#+BEGIN_COMMENT
.. title: R Babel Test
.. slug: r-babel-test
.. date: 2021-12-09 17:08:17 UTC-08:00
.. tags: r,org,experiment
.. category: R
.. link: 
.. description: Seeing about using R in org.
.. type: text

#+END_COMMENT
#+PROPERTY: header-args :session r-test

#+begin_src R :results output :exports both
x <- rnorm(100)
summary(x)
#+end_src

#+RESULTS:
:     Min.  1st Qu.   Median     Mean  3rd Qu.     Max. 
: -1.93398 -0.79415  0.01453 -0.01418  0.67102  2.20682

Does it keep the variables alive between blocks?

#+begin_src R :results output :exports both
summary(x)
#+end_src

#+RESULTS:
:     Min.  1st Qu.   Median     Mean  3rd Qu.     Max. 
: -1.93398 -0.79415  0.01453 -0.01418  0.67102  2.20682

Looks like it.
